{
  "$mulmocast": {
    "version": "1.0",
    "credit": "closing"
  },
  "title": "Foraging Morchella Snyderi and Cooking Chicken & Morel Rice",
  "lang": "en",
  "canvasSize": {
    "width": 1536,
    "height": 1024
  },
  "imageParams": {
    "style": "<style>A multi-panel comic strip. Ghibli style.</style>",
    "images": {
      "shota": {
        "type": "image",
        "source": {
          "kind": "path",
          "path": "../tmp/shota_ghibli.png"
        }
      },
      "dogder": {
        "type": "image",
        "source": {
          "kind": "path",
          "path": "../tmp/dodger_ghibli.png"
        }
      }
    }
  },
  "references": [
    {
      "url": "https://chefshota.substack.com/p/foraging-morchella-snyderi-and-cooking",
      "title": "Foraging Morchella Snyderi and Cooking Chicken & Morel Rice",
      "type": "article"
    }
  ],
  "beats": [
    {
      "text": "Today, we're venturing into the lush forests of the Pacific Northwest with Chef Shota Nakajima, who recently embarked on a foraging journey in the Cascades. His goal: to find the elusive Morchella snyderi, a prized natural black morel mushroom, and craft a simple yet flavorful dish over an open fire."
    },
    {
      "text": "Morchella snyderi, described as a new species in 2012, thrives in unburned montane forests of western North America, including Washington. These mushrooms are characterized by their honeycombed caps and hollow stems, making them a favorite among foragers and chefs alike.",
      "image": {
        "type": "image",
        "source": {
          "kind": "url",
          "url": "https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F4c06dff9-e886-4691-861c-e7b61cdaab37_3840x2160.jpeg"
        }
      }
    },
    {
      "text": "Chef Shota's foraging expedition led him to a bountiful harvest of these natural morels. With their earthy aroma and unique texture, they were the perfect centerpiece for his outdoor culinary creation.",
      "imageNames": ["shota"]
    },
    {
      "text": "Back at his campsite, Chef Shota prepared a one-pot chicken and morel rice dish over an open fire. Utilizing dashi, rice, and the freshly foraged morels, he crafted a meal that was both simple and deeply satisfying, embodying the essence of campfire cooking."
    },
    {
      "text": "This adventure highlights the joy of connecting with nature through foraging and the art of transforming wild ingredients into delicious meals. It's a testament to the rich culinary possibilities that await in the forests of the Pacific Northwest."
    }
  ]
}
